src/Catalogs/Задачи/Задачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Задачи</name>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>ПрефиксВетки</name>
    <type>
      <types>CatalogRef.ПрефиксыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДорабатыватьКонфигурацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаBitrix</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВеткаGit</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Стадия</name>
    <type>
      <types>CatalogRef.СтадииКанбан</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗадачи</name>
    <type>
      <types>EnumRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченноеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановоеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрайнийСрок</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Спринт</name>
    <type>
      <types>CatalogRef.Спринты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиБазовой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЗадача</name>
    <type>
      <types>CatalogRef.Задачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.ТипыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПланировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИзменятьКрайнийСрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипБазовойЗадачи</name>
    <type>
      <types>EnumRef.ТипыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияБазовойЗадачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиИтилиум</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаРелиза</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаMergeRequest</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеФайлы</name>
    <attributes>
      <name>Обработка</name>
      <type>
        <types>CatalogRef.ОбъектыРазработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расширения</name>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>CatalogRef.ОбъектыРазработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КасаемыеПроцессы</name>
    <attributes>
      <name>Процесс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмяПроцесса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>ИДКомментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спринты</name>
    <attributes>
      <name>Спринт</name>
      <type>
        <types>CatalogRef.Спринты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоСпринтРазработки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФактическиеТрудозатраты</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗатраченноеВремя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязанныеЗадачи</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.Задачи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ТаскТрекеры/ТаскТрекеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТаскТрекеры</name>
  <enumValues>
    <name>Bitrix</name>
  </enumValues>
  <enumValues>
    <name>Предприятие1С</name>
  </enumValues>
  <enumValues>
    <name>Отсутствует</name>
  </enumValues>
  <enumValues>
    <name>Jira</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыЗадач/СтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗадач</name>
  <enumValues>
    <name>Завершена</name>
  </enumValues>
  <enumValues>
    <name>ЖдетКонтроля</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>ЖдетВыполнения</name>
  </enumValues>
  <enumValues>
    <name>НаОценке</name>
  </enumValues>
  <enumValues>
    <name>Новая</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыЗадач/ТипыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗадач</name>
  <enumValues>
    <name>ЗНИ</name>
  </enumValues>
  <enumValues>
    <name>Разработка</name>
  </enumValues>
  <enumValues>
    <name>Инцидент</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ПрефиксыЗадач/ПрефиксыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрефиксыЗадач</name>
  <predefined>
    <items>
      <name>add</name>
      <description>add</description>
    </items>
    <items>
      <name>feature</name>
      <description>feature</description>
    </items>
    <items>
      <name>hotfix</name>
      <description>hotfix</description>
    </items>
    <items>
      <name>release</name>
      <description>release</description>
    </items>
  </predefined>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Спринты/Спринты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Спринты</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Задачи/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Объекты разработки
//
// Параметры:
//  Задача	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОбъектыРазработки(Задача) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиВнешниеФайлы.Обработка КАК Обработка
		|ИЗ
		|	Справочник.Задачи.ВнешниеФайлы КАК ЗадачиВнешниеФайлы
		|ГДЕ
		|	ЗадачиВнешниеФайлы.Ссылка = &Задача";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	ОбработкиЗадачи = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Обработка");
	
	Возврат ОбработкиЗадачи;
	
КонецФункции

// Функция - Объекты разработки по задачам
//
// Параметры:
//  Задачи	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОбъектыРазработкиПоЗадачам(Задачи) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗадачиВнешниеФайлы.Обработка КАК Обработка
	|ИЗ
	|	Справочник.Задачи.ВнешниеФайлы КАК ЗадачиВнешниеФайлы
	|ГДЕ
	|	ЗадачиВнешниеФайлы.Ссылка В(&Задача)";
	
	Запрос.УстановитьПараметр("Задача", Задачи);
	
	ОбработкиЗадачи = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Обработка");
	
	Возврат ОбработкиЗадачи;
	
КонецФункции

Функция КоличествоЗадачХотфиксПоЗадаче(НомерЗадачи) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Задачи.Ссылка) КАК КоличествоЗадач
		|ИЗ
		|	Справочник.Задачи КАК Задачи
		|ГДЕ
		|	Задачи.НомерЗадачи = &НомерЗадачи
		|	И Задачи.ПрефиксВетки = &ПрефиксВетки";
	
	Запрос.УстановитьПараметр("НомерЗадачи", НомерЗадачи);
	Запрос.УстановитьПараметр("ПрефиксВетки", Справочники.ПрефиксыЗадач.hotfix);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоЗадач;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ЗадачаПоРазобраннойВетке(СтруктураВетки) Экспорт
	
КонецФункции

Функция ЗадачаПоИмениВетки(ИмяВетки) Экспорт	

	Результат = Справочники.Задачи.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Задачи КАК Задачи
		|ГДЕ
		|	Задачи.ИмяВетки = &ИмяВетки
		|	И НЕ Задачи.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ИмяВетки", ИмяВетки);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыЗадачи(Задача) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Задачи.ИмяВетки КАК ИмяВетки,
		|	ПРЕДСТАВЛЕНИЕ(Задачи.ПрефиксВетки) КАК ПрефиксВетки,
		|	Задачи.ВнешниеФайлы.(
		|		Обработка КАК Обработка
		|	) КАК ВнешниеФайлы,
		|	Задачи.Расширения.(
		|		Расширение КАК Расширение
		|	) КАК Расширения,
		|	Задачи.ДорабатыватьКонфигурацию КАК ДорабатыватьКонфигурацию,
		|	Задачи.ToolsWorld КАК ToolsWorld,
		|	Задачи.Aelita КАК Aelita
		|ИЗ
		|	Справочник.Задачи КАК Задачи
		|ГДЕ
		|	Задачи.Ссылка = &Задача";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	РеквизитыЗадачи = Запрос.Выполнить().Выгрузить()[0];
	
	МассивРасширений = Новый Массив;
	Если РеквизитыЗадачи.ToolsWorld Тогда
		МассивРасширений.Добавить("ToolsWorld");
	КонецЕсли;
	
	Если РеквизитыЗадачи.Aelita Тогда
		МассивРасширений.Добавить("Aelita");
	КонецЕсли;
		
	ПараметрыЗадачи = Новый Структура;
	ПараметрыЗадачи.Вставить("ВнешниеФайлы", СтрСоединить(РеквизитыЗадачи.ВнешниеФайлы.ВыгрузитьКолонку("Обработка"), ","));
	ПараметрыЗадачи.Вставить("Расширения", СтрСоединить(МассивРасширений, ","));
	ПараметрыЗадачи.Вставить("ИмяВетки", СтрШаблон("%1/%2", РеквизитыЗадачи.ПрефиксВетки, РеквизитыЗадачи.ИмяВетки));
	ПараметрыЗадачи.Вставить("ДорабатыватьКонфигурацию", РеквизитыЗадачи.ДорабатыватьКонфигурацию);
	
	Возврат ПараметрыЗадачи;
		
КонецФункции

Функция СоздатьЗадачуИВеткуКНей(НастройкиПользователя ,База , НомерНовойЗадачи, ВариантСозданияЗадачи) Экспорт
	
	Если ВариантСозданияЗадачи = "ХотфиксКЗадаче" Тогда
		Задача = ХотфиксКЗадаче(НомерНовойЗадачи);
	Иначе
		Если ВариантСозданияЗадачи = "НоваяЗадача" Тогда
			ТипЗадачи = Справочники.ПрефиксыЗадач.feature;
		Иначе	
			ТипЗадачи = Справочники.ПрефиксыЗадач.hotfix;
		КонецЕсли;
		Задача = НоваяЗадача(НомерНовойЗадачи, База.Владелец, ТипЗадачи);
	КонецЕсли;

	РаботаСGit.СоздатьНовуюВеткуВГИТПоЗадаче(Задача, База, НастройкиПользователя);
	Возврат Задача;
	
КонецФункции

Функция ХотфиксКЗадаче(НомерЗадачи) Экспорт
	
	Задача = НайтиПоРеквизиту("НомерЗадачи", НомерЗадачи);
	НоваяЗадача = Задача.Скопировать();
	КоличествоЗадач = КоличествоЗадачХотфиксПоЗадаче(НомерЗадачи);
	НоваяЗадача.ИмяВетки = СтрШаблон("%1_%2_%3", Задача.НомерЗадачиБазовой, НомерЗадачи, КоличествоЗадач + 1);
	НоваяЗадача.Код = НоваяЗадача.ИмяВетки;
	НоваяЗадача.ОсновнаяЗадача = Задача;
	НоваяЗадача.ПрефиксВетки = Справочники.ПрефиксыЗадач.hotfix;
	НоваяЗадача.Наименование = СтрШаблон("%1 Исправление № %2", НоваяЗадача.Наименование, КоличествоЗадач + 1);
	Если Не НоваяЗадача.ПроверитьЗаполнение() Тогда
		ВызватьИсключение(НСтр("ru='Задачу не вышло записать'"));
	КонецЕсли;
	НоваяЗадача.Записать();
	
	Возврат НоваяЗадача.Ссылка;
	
КонецФункции

Функция НоваяЗадача(НомерЗадачи, Проект, ТипЗадачи = Неопределено) Экспорт
	
	Задача = НайтиПоРеквизиту("НомерЗадачи", НомерЗадачи);
	Если Задача = Справочники.Задачи.ПустаяСсылка() Тогда
		ДанныеЗаполнения = ДанныеЗаполненияПоЗадаче(НомерЗадачи, Проект);
		Если ЗначениеЗаполнено(ТипЗадачи) Тогда
			ДанныеЗаполнения.Вставить("ПрефиксВетки", ТипЗадачи);
		КонецЕсли;
		ДозаполнитьДаннымиПоУмолчанию(ДанныеЗаполнения);
		
		ЗадачаОбъект = СоздатьЭлемент();
		ЗадачаОбъект.Заполнить(ДанныеЗаполнения);
		Если Не ЗадачаОбъект.ПроверитьЗаполнение() Тогда
			ВызватьИсключение НСтр("ru='Проверка записи задачи не прошла'");
		КонецЕсли;
		ЗадачаОбъект.Записать();
		Задача = ЗадачаОбъект.Ссылка;
	ИначеЕсли ТипЗадачи <> Неопределено
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "ПрефиксВетки") <> ТипЗадачи Тогда
		ЗадачаОбъект = Задача.ПолучитьОбъект();
		ЗадачаОбъект.ПрефиксВетки = ТипЗадачи;
		ЗадачаОбъект.Записать();
	КонецЕсли;
	
	Возврат Задача;
	
КонецФункции

Процедура ДозаполнитьДаннымиПоУмолчанию(ДанныеЗаполнения)
	
	Если Не ДанныеЗаполнения.Свойство("ПрефиксВетки") Тогда
		ДанныеЗаполнения.Вставить("ПрефиксВетки", Справочники.ПрефиксыЗадач.feature);
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеЗаполненияПоЗадаче(НомерЗадачи, Проект) Экспорт
	
	ДанныеЗаполнения = Новый Структура();
	ТаскТрекер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Проект, "ТаскТрекер");
	ТипТаскТрекера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТаскТрекер, "ТипТаскТрекера");
	Если ТипТаскТрекера = Перечисления.ТаскТрекеры.Bitrix Тогда
		ДанныеЗаполнения = РаботаСBitrix.СтруктурированныеДанныеПоЗадачеИзБитрикс(НомерЗадачи);
	ИначеЕсли ТипТаскТрекера = Перечисления.ТаскТрекеры.Предприятие1С Тогда
		ДанныеЗаполнения = РаботаСПредприятие1С.СтруктурированныеДанныеПоЗадаче(НомерЗадачи, ТаскТрекер);
	КонецЕсли;

	Возврат ДанныеЗаполнения;
	
КонецФункции

Функция ПоследнийСпринт(Задача) Экспорт

	Результат = Справочники.Спринты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗадачиСпринты.Спринт.ДатаНачала КАК ДатаНачала,
		|	ЗадачиСпринты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Задачи.Спринты КАК ЗадачиСпринты
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачала УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьКомментарийКЗадаче(Задача, Комментарий, Токен = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Токен) Тогда
		Токен = "1/" +РаботаСBitrix.ТокенBitrix();
	КонецЕсли;
	
	СсылкаBitrix = СсылкаBitrix() + Токен;
	OPI_Bitrix24.ДобавитьКомментарийЗадачи(СсылкаBitrix, Задача.НомерЗадачи, Комментарий);
	
КонецПроцедуры

Процедура ПеревестиЗадачуНаСтадиюТестирования(Задача)
	
	Тестирование = РаботаСBitrix.СоответствиеСостоянийКанбан()["Тестирование"];
	СсылкаBitrix = СсылкаBitrix() + РаботаСBitrix.ТокенBitrix();
	OPI_Bitrix24.ПеренестиЗадачуВСтадиюКанбана(СсылкаBitrix, Задача.НомерЗадачи, Тестирование);

КонецПроцедуры

Функция ВеткаЗадачи(Задача) Экспорт
	
	ДанныеВетки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Задача, "ПрефиксВетки, ИмяВетки");	
	Возврат СтрШаблон("%1/%2", ДанныеВетки.ПрефиксВетки, ДанныеВетки.ИмяВетки);
	
КонецФункции

Функция КаталогиТестовЧерезЗапятую(Задача) Экспорт
	
	КаталогиТестов = КаталогиТестов(Задача);
	
	КаталогиТестовОтформатированные = Новый Массив;
	КаталогиТестовЧерезЗапятую = "";
	
	Для Каждого КаталогТеста Из КаталогиТестов Цикл
		НомерСимволаСтрокиФича = СтрНайти(КаталогТеста, "\feature");
		КаталогТеста = Прав(КаталогТеста, СтрДлина(КаталогТеста) - НомерСимволаСтрокиФича);
		КаталогиТестовОтформатированные.Добавить(КаталогТеста);
	КонецЦикла;
	
	Возврат СтрСоединить(КаталогиТестовОтформатированные, ",");
	
КонецФункции

Функция РасширенияЧерезЗапятую(Задача) Экспорт
	
	Результат = Новый Массив;
	Если Задача.ToolsWorld Тогда
		Результат.Добавить("ToolsWorld");
	КонецЕсли;
	
	Если Задача.Aelita Тогда
		Результат.Добавить("Aelita");
	КонецЕсли;
	
	Возврат СтрСоединить(Результат, ",");
	
КонецФункции

Функция КаталогиТестов(Задача) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачиКасаемыеПроцессы.ПолноеИмяПроцесса КАК ПолноеИмяПроцесса
	|ИЗ
	|	Справочник.Задачи.КасаемыеПроцессы КАК ЗадачиКасаемыеПроцессы
	|ГДЕ
	|	ЗадачиКасаемыеПроцессы.Ссылка = &Задача";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПолноеИмяПроцесса");
	
КонецФункции

Процедура ЗагрузитьЗадачиЗаПериодBitrix()
	ДатаПоследнейЗадачи =  ТекущаяДата() - 86400 * 10;	
	
	Фильтр = Новый Структура;
	Фильтр.Вставить(">CREATED_DATE", ДатаПоследнейЗадачи); //Тестово 10 дней
	
	Токен = "1/" +РаботаСBitrix.ТокенBitrix();
	СсылкаBitrix = СсылкаBitrix() + Токен;
	
	Отступ = 1;
	Результат = OPI_Bitrix24.ПолучитьСписокЗадач(СсылкаBitrix, Фильтр, Отступ, Токен);
	
КонецПроцедуры

Функция ДатаПоследнейЗадачи()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Первые 1
		|	МАКСИМУМ(Задачи.ДатаСоздания) КАК ДатаСоздания
		|ИЗ
		|	Справочник.Задачи КАК Задачи";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ДатаСоздания;

КонецФункции

Функция ЗадачаПоВетке(НастройкиПользователя, НомерЗадачи = Неопределено, Ветка = Неопределено, База = Неопределено) Экспорт
	
	Если НомерЗадачи = Неопределено И Ветка = Неопределено Тогда
		ВызватьИсключение "Параметры ""Номер задачи"" или ""Ветка"" должны быть заполнены!";
	КонецЕсли;
	
	Если НомерЗадачи = Неопределено Тогда
		НомерЗадачи = РаботаСGit.РазобраннаяВетка(Ветка).НомерЗадачиРазработки;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НомерЗадачи) Тогда
		Возврат Справочники.Задачи.ПустаяСсылка();	
	КонецЕсли;
	Если База = Неопределено Тогда
		ВызватьИсключение "Параметр ""База"" должен быть заполнен!";	
	КонецЕсли;	
	Задача = НоваяЗадача(НомерЗадачи, База.Владелец);
	
	Возврат Задача;
	
КонецФункции

Функция НеЗакрытыеЗадачи() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи.Ссылка КАК Задача,
		|	Задачи.Владелец КАК Проект,
		|	Задачи.НомерЗадачи КАК НомерЗадачи
		|ИЗ
		|	Справочник.Задачи КАК Задачи
		|ГДЕ
		|	Задачи.СтатусЗадачи <> &СтатусЗадачи";
	
	Запрос.УстановитьПараметр("СтатусЗадачи", Перечисления.СтатусыЗадач.Завершена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции

Функция НомераЗадачИСсылкиПоСписку(СписокЗадач) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи.Ссылка КАК Задача,
		|	Задачи.Владелец КАК Проект,
		|	Задачи.НомерЗадачи КАК НомерЗадачи
		|ИЗ
		|	Справочник.Задачи КАК Задачи
		|ГДЕ
		|	Задачи.Ссылка В(&СписокЗадач)";
	
	Запрос.УстановитьПараметр("СписокЗадач", СписокЗадач);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции

Функция ЗадачиПоСпринтам(Ответственные, Спринты) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Задачи.Ссылка КАК Задача,
	|	ВЫБОР
	|		КОГДА Задачи.ДатаСозданияБазовойЗадачи > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Задачи.ДатаСозданияБазовойЗадачи
	|		ИНАЧЕ Задачи.ДатаСоздания
	|	КОНЕЦ КАК ДатаСоздания,
	|	ВЫБОР
	|		КОГДА Задачи.ТипБазовойЗадачи = ЗНАЧЕНИЕ(Перечисление.ТипыЗадач.Инцидент)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПорядокСортировки,
	|	Задачи.ТипБазовойЗадачи КАК ТипБазовойЗадачи,
	|	Задачи.НеИзменятьКрайнийСрок КАК НеИзменятьКрайнийСрок,
	|	Задачи.Наименование КАК Наименование,
	|	Задачи.Ответственный КАК Ответственный,
	|	Задачи.ПлановоеВремя / 60 КАК ПлановоеВремя,
	|	Задачи.ЗатраченноеВремя / 60 КАК ЗатраченноеВремя,
	|	Задачи.КрайнийСрок КАК КрайнийСрок,
	|	ВЫБОР
	|		КОГДА Задачи.Спринт = ЗНАЧЕНИЕ(Справочник.Спринты.ПустаяСсылка)
	|			ТОГДА &Неразобранно
	|		ИНАЧЕ Задачи.Спринт
	|	КОНЕЦ КАК Спринт,
	|	Задачи.Спринт.ДатаНачала КАК ДатаНачала,
	|	Задачи.Спринт.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	Справочник.Задачи КАК Задачи
	|ГДЕ
	//|	Задачи.СтатусЗадачи В(&СтатусЗадачи)
	|	НЕ Задачи.НеПланировать
	|	И Задачи.Ответственный В(&Ответственный)
	|	И (Задачи.Спринт В (&Спринты)
	|			ИЛИ Задачи.Спринт = ЗНАЧЕНИЕ(Справочник.Спринты.ПустаяСсылка))
	|	И Задачи.ПрефиксВетки = ЗНАЧЕНИЕ(Справочник.ПрефиксыЗадач.feature)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Спринт,
	|	ПорядокСортировки,
	|	ДатаСоздания";
	
	Запрос.УстановитьПараметр("Ответственный", Ответственные);
	Запрос.УстановитьПараметр("Спринты", Спринты);

	Неразобранно = Справочники.Спринты.НайтиПоНаименованию("Неразобранно");
	Запрос.УстановитьПараметр("Неразобранно", Неразобранно);
	
	СтатусЗадачи = Новый Массив;
	СтатусЗадачи.Добавить(Перечисления.СтатусыЗадач.Выполняется);
	СтатусЗадачи.Добавить(Перечисления.СтатусыЗадач.ЖдетВыполнения);
	Запрос.УстановитьПараметр("СтатусЗадачи", СтатусЗадачи);
	
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ТаблицаОткрытыхЗадач(ПользователиСАвтотрудозатратами, Спринт = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Задачи.Ссылка КАК Задача,
	               |	Задачи.ЗатраченноеВремя КАК ЗатраченноеВремя,
	               |	Задачи.ПлановоеВремя КАК ПлановоеВремя,
	               |	Задачи.Ответственный КАК Пользователь,
	               |	0 КАК ДобавленноеВремя,
	               |	Задачи.НомерЗадачи КАК НомерЗадачи
	               |ИЗ
	               |	Справочник.Задачи КАК Задачи
	               |ГДЕ
	               |	Задачи.Ответственный В(&Пользователи)
	               |	И Задачи.СтатусЗадачи <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗадач.Завершена)
	               |	И (&Спринт = НЕОПРЕДЕЛЕНО
	               |			ИЛИ Задачи.Спринт = &Спринт)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПлановоеВремя";
	
	Запрос.УстановитьПараметр("Пользователи", ПользователиСАвтотрудозатратами);
	Запрос.УстановитьПараметр("Спринт", Спринт);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура УстановитьАдресМерджРеквеста(ТекущаяЗадача, АдресМерджРеквеста) Экспорт
	
	ЗадатаОбъект = ТекущаяЗадача.ПолучитьОбъект();
	ЗадатаОбъект.СсылкаMergeRequest = АдресМерджРеквеста;
	ЗадатаОбъект.Записать();
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СсылкаBitrix()
	
	Возврат "https://b24/rest/";
	
КонецФункции

Функция СтатусЗадачи(НомерСтатуса) Экспорт

	Результат = Новый Соответствие;
	Результат.Вставить("2", Перечисления.СтатусыЗадач.ЖдетВыполнения);
	Результат.Вставить("3", Перечисления.СтатусыЗадач.Выполняется);
	Результат.Вставить("4", Перечисления.СтатусыЗадач.ЖдетКонтроля);
	Результат.Вставить("5", Перечисления.СтатусыЗадач.Завершена);
	
	Возврат Результат[НомерСтатуса];
	
КонецФункции

Функция ПривестиКЧислу(Значение)
	
	Если ЗначениеЗаполнено(Значение) Тогда
		Возврат Значение;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции
#КонецОбласти

#КонецЕсли
